app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        activities = Activity.all

SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 2]]
DELETE FROM "signups" WHERE "signups"."id" = ?  [["id", 1]]
---
    def destroy
        activity = Activity.find_by(id: params[:id])
        if activity
            activity.signups.destroy_all
            activity.destroy