app/controllers/campers_controller.rb

    def index
        campers = Camper.all
---
SELECT "campers".* FROM "campers"

    def show
        camper = Camper.find_by(id: params[:id])
---
SELECT "campers".* FROM "campers" WHERE "campers"."id" = ? LIMIT ?  [["id", 67], ["LIMIT", 1]]

    def create
        camper = Camper.new(camper_params)
        if camper.save
---
INSERT INTO "campers" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Dariana"], ["age", 8], ["created_at", "2021-08-13 19:09:01.356135"], ["updated_at", "2021-08-13 19:09:01.356135"]]