app/controllers/signups_controller.rb

    def create
        signup = Signup.new(signup_params)
        if signup.save
---
INSERT INTO "signups" ("time", "camper_id", "activity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["time", 13], ["camper_id", 1], ["activity_id", 4], ["created_at", "2021-08-13 19:34:46.595357"], ["updated_at", "2021-08-13 19:34:46.595357"]]